rails-test/app/controllers/quotes_controller.rb

SELECT * FROM "Quote" ORDER BY datetime DESC LIMIT 1000
---
  def index
    @quotes = Quote.all :order => "datetime DESC", :limit => 1000